app/controllers/products_controller.rb

  def create
    @product = Product.new
    @product.name = params[:product][:name]
    @product.description = params[:product][:description]
    @product.price_in_cents = params[:product][:price_in_cents]

    if @product.save
---
INSERT INTO "products" ("name", "description", "price_in_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dd"], ["description", "dd"], ["price_in_cents", 0], ["created_at", "2018-08-15 16:18:57.082852"], ["updated_at", "2018-08-15 16:18:57.082852"]]

  def update
    @product = Product.find(params[:id])

    @product.name = params[:product][:name]
    @product.description = params[:product][:description]
    @product.price_in_cents = params[:product][:price_in_cents]

    if @product.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "price_in_cents" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Axe"], ["description", "Cut shit up!"], ["price_in_cents", 2000], ["updated_at", "2018-08-15 16:31:30.426716"], ["id", 4]]