app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("product_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["comment", "I hate this thing"], ["created_at", "2018-08-15 18:24:31.148361"], ["updated_at", "2018-08-15 18:24:31.148361"]]
---
  def create
    @review = Review.new
    @product = Product.find(params[:product_id])
    @review.comment = params[:review][:comment]
    @review.product_id = params[:product_id]

    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @review = Review.find(params[:id])
    @product = Product.find(params[:product_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "i need more pouches for all my water"], ["updated_at", "2018-08-15 18:55:56.604559"], ["id", 1]]
---
  def update
    @review = Review.find(params[:id])
    @product = Product.find(params[:product_id])
    @review.comment = params[:review][:comment]
    if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 2]]
---
  def destroy
    @review = Review.find(params[:id])
    @product = Product.find(params[:product_id])
    @review.destroy