app/views/products/_reviews.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."product_id" = ? LIMIT ?  [["product_id", 1], ["LIMIT", 1]]
---
<h3>Reviews</h3>
<% if product.reviews.empty? %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
---
  <% else %>
    <% product.reviews.each do |review| %>